docs/manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-01 Thu 10:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Editor operation manual for jardinbretagne.com</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="mikkel" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Editor operation manual for jardinbretagne.com</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb5edc09">1. Editing existing material</a>
<ul>
<li><a href="#org07b1923">1.1. The editing tools</a></li>
<li><a href="#org3cb2a83">1.2. What can be edited</a></li>
<li><a href="#org33cddbe">1.3. What can’t be edited</a></li>
<li><a href="#orgc1d1eac">1.4. What is a page?</a></li>
<li><a href="#org367e6f3">1.5. Draft mode</a></li>
<li><a href="#org0661a96">1.6. How to edit the website’s elements</a>
<ul>
<li><a href="#org24eb19f">1.6.1. Menus</a></li>
<li><a href="#orgbc745d7">1.6.2. Homepage</a></li>
<li><a href="#org2612aac">1.6.3. Single Pages</a></li>
<li><a href="#org779f1cc">1.6.4. Special single pages</a></li>
<li><a href="#org9399a85">1.6.5. list pages</a></li>
<li><a href="#orgd07a9a2">1.6.6. special list pages</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org07169a5">2. Creating new material</a>
<ul>
<li><a href="#org7c9d618">2.1. What can be created?</a></li>
<li><a href="#orgebcf2e1">2.2. Where can single column pages be created?</a></li>
</ul>
</li>
<li><a href="#orgf8db7dd">3. Translating the material</a>
<ul>
<li><a href="#orge4249c4">3.1. How translation works</a></li>
</ul>
</li>
<li><a href="#org9e1bf24">4. Images</a></li>
<li><a href="#org8a09b4b">5. Underlying technologies</a>
<ul>
<li><a href="#orgec8ab01">5.1. markdown</a>
<ul>
<li><a href="#org85b39f6">5.1.1. links in markdown</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This document aims to provide exhaustive guidance for editors whose job it is to elaborate the content of this new website for the <i>Parc Botanique de Haut Bretagne</i>.
</p>

<p>
For the technically curious it also provides, at the end, a very cursory overview of the technologies with which it was built.
</p>
<div id="outline-container-orgb5edc09" class="outline-2">
<h2 id="orgb5edc09"><span class="section-number-2">1</span> Editing existing material</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org07b1923" class="outline-3">
<h3 id="org07b1923"><span class="section-number-3">1.1</span> The editing tools</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The site owner and her editors can use the site’s <a href="https://forestry.io">forestry</a> interface both to edit existing material and to create new pages. The final way to access these editing tools remains to be determined.
</p>
</div>
</div>
<div id="outline-container-org3cb2a83" class="outline-3">
<h3 id="org3cb2a83"><span class="section-number-3">1.2</span> What can be edited</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Most of the site’s content can be edited. This includes its <a href="#org24eb19f">menus</a>, all the content on the <a href="#orgbc745d7">homepage</a>, and, of course, the contents of the individual <a href="#org2612aac">pages</a>.
</p>
</div>
</div>
<div id="outline-container-org33cddbe" class="outline-3">
<h3 id="org33cddbe"><span class="section-number-3">1.3</span> What can’t be edited</h3>
<div class="outline-text-3" id="text-1-3">
<p>
At the moment there is no way to edit the content of the footer that’s found at the bottom of every page. You should agree with the developer a final version of this before the site is handed off.
</p>

<p>
It’s also not possible to change the way the site as a whole <b>looks</b>. That’s fixed by the design. This relieves the site owner and her editors of the responsibility to decide how things should look: those decisions have already been taken.
</p>

<p>
If the site owner or the editors discover that some kind of agreed content looks <b>broken</b> when it’s displayed, then this problem should be addressed to the developer.
</p>
</div>
</div>
<div id="outline-container-orgc1d1eac" class="outline-3">
<h3 id="orgc1d1eac"><span class="section-number-3">1.4</span> What is a page?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
When we edit a page in forestry, we see two panels: on the left hand side, a list of toggles and switches; on the right hand side, a text editor. 
</p>
</div>
<ol class="org-ol">
<li><a id="orgc49fea1"></a>front matter<br />
<div class="outline-text-5" id="text-1-4-0-1">
<p>
The left hand side represents a page’s “front-matter”. These are “settings” for the page. They allow us to set what the large image at the top of the page should be, how the page should be summarised, and other features of the page.
</p>
</div>
</li>
<li><a id="org0bc20cd"></a>content<br />
<div class="outline-text-5" id="text-1-4-0-2">
<p>
The right hand side represents the “contents” of a page. This is what is shown in the main body of a page: the main column of text and images.
</p>

<p>
This is shown by default in a friendly word-processor-like format. The file itself is in a format called <a href="https://commonmark.org/help/">markdown</a>; you can see this source by clicking the three dots in the upper-right corner of the forestry editor and clicking “raw editor” to see what things are being built from. This may sometimes be useful, but should mostly be unnecessary. <b>However, since some functionality of the site requires the editors to write raw markdown</b> (see, for example, <a href="#org813db41">here</a>) <b>I recommend editors take the time to work through this <a href="https://commonmark.org/help/tutorial/">10-minute markdown tutorial</a></b> if they don’t already know how to use this very useful markup language.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org367e6f3" class="outline-3">
<h3 id="org367e6f3"><span class="section-number-3">1.5</span> Draft mode</h3>
<div class="outline-text-3" id="text-1-5">
<p>
All pages have a “draft” property, allowing them to be written up without appearing on the live site. When the page is ready, turn draft mode off, and the page will appear on the site.
</p>
</div>
</div>

<div id="outline-container-org0661a96" class="outline-3">
<h3 id="org0661a96"><span class="section-number-3">1.6</span> How to edit the website’s elements</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org24eb19f" class="outline-4">
<h4 id="org24eb19f"><span class="section-number-4">1.6.1</span> Menus</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
The menus are all automatically generated. Different menus are generated from different sources. Some of these menus can be adjusted by the editors.
</p>
</div>
<ol class="org-ol">
<li><a id="org0adea81"></a>What editable menus are there?<br />
<div class="outline-text-5" id="text-1-6-1-1">
<p>
The main menu which runs across the top of every page (the <a href="#orgc321c1d">main menu</a>) and the set of black cards on the homepage (the <a href="#orgf748080">quicklinks</a>) can both be edited. The other menus are all completely automatic and can’t be edited. They will update themselves to reflect changes in the content.
</p>
</div>
</li>
<li><a id="org4b09771"></a>Sources of the menus<br />
<ol class="org-ol">
<li><a id="orge80f9eb"></a>Front matter<br />
<div class="outline-text-6" id="text-1-6-1-2-1">
<p>
As explained <a href="#orgc1d1eac">above</a>, all pages have associated “front matter” which is basically the settings for the page. One of these settings is called “menu”: this setting allows the editors to announce that they want the item to appear in the “main” or the “quicklinks” menu. 
</p>
</div>
</li>
<li><a id="org813db41"></a>config.toml<br />
<div class="outline-text-6" id="text-1-6-1-2-2">
<p>
In order to allow linking offsite, or to parts of the site that are not pages, it’s possible to define cards in the <code>settings</code> file <code>config.toml</code>. In principle it’s possible to add elements to any menu in this file, but the developer’s intention is that it only be used to modify the black <code>quicklinks</code> on the front page.
</p>

<p>
The <code>quicklinks</code> are defined independently for each language - see internationalization - and the editors can add and remove as many as they like, although they should keep an eye on the visual effect this has on the homepage. Sticking to three is probably best, but four or even 5 might work ok.
</p>
</div>
</li>
</ol>
</li>
<li><a id="orgc321c1d"></a>Main (top) menu<br />
<div class="outline-text-5" id="text-1-6-1-3">
<p>
This menu is generated exclusively from the <a href="#orge80f9eb">front-matter</a> of the site’s pages. That means that every page whose <code>menu</code> settings includes the setting <code>main</code> will show up here. That can mean an awful lot of menu entries! The developer would <b>strongly</b> recommend aiming to minimize the number of entries along this top bar to 4 or 5: it’s important to make the initial choices of users as simple as possible. If the editors want to emphasise some content, they can use <a href="#orgf748080">quicklinks</a> or <a href="#org9e326c4">feature cards</a>. 
</p>
</div>
</li>
