docs/manual.org
**** quicklinks
The quicklinks - the black ’cards’ on the front page - are designed to allow the editors to highlight particular pages on the website, and to make prominent links off-site, for instance to the garden’s guest booking system.

They are generated from two sources: 
+ from the [[*Front matter][Front matter]] of the site’s various pages (any page with ’quicklinks’ in its ~menu~ setting will show up)
+ from the entries in the ~quicklinks~ list defined underneath each of the site’s languages in [[*config.toml][config.toml]].
*** Homepage

**** carousel
The carousel is configured in the ~settings~ file ~carousel.toml~. See the [[*Images][image guidelines]] for advice about appropriate image sizes. At its full size the carousel is 1800 pixels wide and 800 pixels tall: although it will automatically make whatever images you assign to it fit, if you want the maximum possible control over how the image is displayed you should crop your images in this aspect ratio. But It’s probably better as a rule just to pick normal photographs that look nice and let the software crop them - it will normally be good enough.
**** feature cards
These are the “cards” at the bottom of the homepage: an image, with a little text that can feature links. These are designed to allow a more engaging way to emphasise content than the quicklinks.

These are configured in the [[*Front matter][Front matter]] of the homepages for the different enabled languages. The features for each language must be configured separately (but note that you don’t have to upload the image you want to use multiple times: once you’ve done it once, you’ll find it in forestry’s media library.)

Their settings are fairly self-explanatory. The only tricky thing is that links must be written in the markup language [[*content][markdown]]. See [[*links in markdown][links in markdown]].

**** quicklinks
These are the black boxes just underneath the “welcome” sign. Their configuration is discussed underneath [[*quicklinks][menus]]. It’s very straightforward except that, as with [[*feature cards][feature cards]], any links must be inserted with explicit [[*content][markdown]]; see [[*links in markdown][links in markdown]].
*** Single Pages
Most pages on the site are ~single column pages~. That means that they have some default [[*front matter][front matter]] and that they display whatever [[*content][content]] the editors give them in a single column that runs down the center of the page. *almost all the customization of the website involves adding content to single pages.* You can add as much content as you like to an individual page.
**** featured images
  Every single page can have what’s called a ~hero~ image, called in the page’s front matter a ~featuredImage~. This is shown at the top of the page.
**** summaries and card images
When single pages appear in menus, they often appear with a ~summary~ text. This is automatically generated by default, but quite stupidly; The editors can (and normally should) explicitly define a ~summary~ in each page’s front matter.

When single pages appear in menus, they sometimes appear with an image. This image is derived from the ~featuredImage~ if one exists. If this isn’t desirable for some reason, it’s also possible to add a ~cardImage~; this will be used instead of the ~featuredImage~ for menu cards.
*** Special single pages
**** The info page
The info page is a single-column page, but (because it’s where we store lots of bits of information) it also has a submenu. This submenu is automatically generated from two sources:

+ the headers in the content of the info page
+ the other single column pages in the info folder.
*** list pages
Some pages exist just to show subpages. For instance, ~/evenements/~ shows the three events that are defined, ~hanami~, ~concours~ and ~voyageurs~. These pages are automatically generated based on the front-matter of the pages they show.
*** special list pages
**** hanami, concours and voyageurs
These are a bit complex. Each of them is a bit like a little blog: editors can add new pages 
These are basically little blogs. A new page in ~hanami~, ~concours~ or ~voyageurs~ must have its ~date~ set in the front-matter to correspond to the date when the event took place. *these pages will always show the latest event*, while offering links to previous events.
* Creating new material
** What can be created?
As presently configured, the editors can create *single-column-pages*, *quicklinks* and *feature cards*. everything else is automatically generated.
** Where can single column pages be created?
New single column pages will be recognised and indexed when they are created in the following subdirectories:

+ ~/info~
+ ~/location~
+ ~/garden~
+ ~/evenements/hanami~
+ ~/evenements/concours~
+ ~/evenements/voyageurs~
* Translating the material
** How translation works
Every translation is a kind of “shadow copy” of the default (french) site’s content. Each copy has its own folder: ~content/LANGUAGE~. Every page to be translated must exist in *both* folders, in *identical* places, with an *identical* file name. 

The translation is configured in ~config.toml~, where each language has its own settings (under ~languages~.) This includes the translation of the site’s title and the ~quicklinks~. 

Also in the ~config.toml~ is the option to *disable* certain languages. Any language-codes specified here (“en”, “es” etc) will not be available on the site, even if their translation files are there. This is like “draft mode” for site-translation. When you’re working on a translation, disable it! then when the translation is finished, remove the setting.
* Images
Images should *always* be less than or equal to 1mb in size. This is critical for google search rankings and user experience, as well as the sustainability of the site as currently configured. (We can support many hundreds of 1mb images.)

I recommend starting with the free tool [[https://imageoptim.com/howto.html][imageoptim]] in dealing with this problem. I’m available to help if this proves too difficult to handle. 
