docs/manual.html

<li><a id="orgf748080"></a>quicklinks<br />
<div class="outline-text-5" id="text-1-6-1-4">
<p>
The quicklinks - the black ’cards’ on the front page - are designed to allow the editors to highlight particular pages on the website, and to make prominent links off-site, for instance to the garden’s guest booking system.
</p>

<p>
They are generated from two sources: 
</p>
<ul class="org-ul">
<li>from the <a href="#orge80f9eb">Front matter</a> of the site’s various pages (any page with ’quicklinks’ in its <code>menu</code> setting will show up)</li>
<li>from the entries in the <code>quicklinks</code> list defined underneath each of the site’s languages in <a href="#org813db41">config.toml</a>.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgbc745d7" class="outline-4">
<h4 id="orgbc745d7"><span class="section-number-4">1.6.2</span> Homepage</h4>
<div class="outline-text-4" id="text-1-6-2">
</div>
<ol class="org-ol">
<li><a id="org0f0c936"></a>carousel<br />
<div class="outline-text-5" id="text-1-6-2-1">
<p>
The carousel is configured in the <code>settings</code> file <code>carousel.toml</code>. See the <a href="#org9e1bf24">image guidelines</a> for advice about appropriate image sizes. At its full size the carousel is 1800 pixels wide and 800 pixels tall: although it will automatically make whatever images you assign to it fit, if you want the maximum possible control over how the image is displayed you should crop your images in this aspect ratio. But It’s probably better as a rule just to pick normal photographs that look nice and let the software crop them - it will normally be good enough.
</p>
</div>
</li>
<li><a id="org9e326c4"></a>feature cards<br />
<div class="outline-text-5" id="text-1-6-2-2">
<p>
These are the “cards” at the bottom of the homepage: an image, with a little text that can feature links. These are designed to allow a more engaging way to emphasise content than the quicklinks.
</p>

<p>
These are configured in the <a href="#orge80f9eb">Front matter</a> of the homepages for the different enabled languages. The features for each language must be configured separately (but note that you don’t have to upload the image you want to use multiple times: once you’ve done it once, you’ll find it in forestry’s media library.)
</p>

<p>
Their settings are fairly self-explanatory. The only tricky thing is that links must be written in the markup language <a href="#org0bc20cd">markdown</a>. See <a href="#org85b39f6">links in markdown</a>.
</p>
</div>
</li>

<li><a id="org65fc502"></a>quicklinks<br />
<div class="outline-text-5" id="text-1-6-2-3">
<p>
These are the black boxes just underneath the “welcome” sign. Their configuration is discussed underneath <a href="#orgf748080">menus</a>. It’s very straightforward except that, as with <a href="#org9e326c4">feature cards</a>, any links must be inserted with explicit <a href="#org0bc20cd">markdown</a>; see <a href="#org85b39f6">links in markdown</a>.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org2612aac" class="outline-4">
<h4 id="org2612aac"><span class="section-number-4">1.6.3</span> Single Pages</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
Most pages on the site are <code>single column pages</code>. That means that they have some default <a href="#orgc49fea1">front matter</a> and that they display whatever <a href="#org0bc20cd">content</a> the editors give them in a single column that runs down the center of the page. <b>almost all the customization of the website involves adding content to single pages.</b> You can add as much content as you like to an individual page.
</p>
</div>
<ol class="org-ol">
<li><a id="orgb1f6f69"></a>featured images<br />
<div class="outline-text-5" id="text-1-6-3-1">
<p>
Every single page can have what’s called a <code>hero</code> image, called in the page’s front matter a <code>featuredImage</code>. This is shown at the top of the page.
</p>
</div>
</li>
<li><a id="org75164f7"></a>summaries and card images<br />
<div class="outline-text-5" id="text-1-6-3-2">
<p>
When single pages appear in menus, they often appear with a <code>summary</code> text. This is automatically generated by default, but quite stupidly; The editors can (and normally should) explicitly define a <code>summary</code> in each page’s front matter.
</p>

<p>
When single pages appear in menus, they sometimes appear with an image. This image is derived from the <code>featuredImage</code> if one exists. If this isn’t desirable for some reason, it’s also possible to add a <code>cardImage</code>; this will be used instead of the <code>featuredImage</code> for menu cards.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org779f1cc" class="outline-4">
<h4 id="org779f1cc"><span class="section-number-4">1.6.4</span> Special single pages</h4>
<div class="outline-text-4" id="text-1-6-4">
</div>
<ol class="org-ol">
<li><a id="org326eb76"></a>The info page<br />
<div class="outline-text-5" id="text-1-6-4-1">
<p>
The info page is a single-column page, but (because it’s where we store lots of bits of information) it also has a submenu. This submenu is automatically generated from two sources:
</p>

<ul class="org-ul">
<li>the headers in the content of the info page</li>
<li>the other single column pages in the info folder.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org9399a85" class="outline-4">
<h4 id="org9399a85"><span class="section-number-4">1.6.5</span> list pages</h4>
<div class="outline-text-4" id="text-1-6-5">
<p>
Some pages exist just to show subpages. For instance, <code>/evenements/</code> shows the three events that are defined, <code>hanami</code>, <code>concours</code> and <code>voyageurs</code>. These pages are automatically generated based on the front-matter of the pages they show.
</p>
</div>
</div>
<div id="outline-container-orgd07a9a2" class="outline-4">
<h4 id="orgd07a9a2"><span class="section-number-4">1.6.6</span> special list pages</h4>
<div class="outline-text-4" id="text-1-6-6">
</div>
<ol class="org-ol">
<li><a id="orgf57aecf"></a>hanami, concours and voyageurs<br />
<div class="outline-text-5" id="text-1-6-6-1">
<p>
These are a bit complex. Each of them is a bit like a little blog: editors can add new pages 
These are basically little blogs. A new page in <code>hanami</code>, <code>concours</code> or <code>voyageurs</code> must have its <code>date</code> set in the front-matter to correspond to the date when the event took place. <b>these pages will always show the latest event</b>, while offering links to previous events.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org07169a5" class="outline-2">
<h2 id="org07169a5"><span class="section-number-2">2</span> Creating new material</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7c9d618" class="outline-3">
<h3 id="org7c9d618"><span class="section-number-3">2.1</span> What can be created?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
As presently configured, the editors can create <b>single-column-pages</b>, <b>quicklinks</b> and <b>feature cards</b>. everything else is automatically generated.
</p>
</div>
</div>
<div id="outline-container-orgebcf2e1" class="outline-3">
<h3 id="orgebcf2e1"><span class="section-number-3">2.2</span> Where can single column pages be created?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
New single column pages will be recognised and indexed when they are created in the following subdirectories:
</p>

<ul class="org-ul">
<li><code>/info</code></li>
<li><code>/location</code></li>
<li><code>/garden</code></li>
<li><code>/evenements/hanami</code></li>
<li><code>/evenements/concours</code></li>
<li><code>/evenements/voyageurs</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf8db7dd" class="outline-2">
<h2 id="orgf8db7dd"><span class="section-number-2">3</span> Translating the material</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge4249c4" class="outline-3">
<h3 id="orge4249c4"><span class="section-number-3">3.1</span> How translation works</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Every translation is a kind of “shadow copy” of the default (french) site’s content. Each copy has its own folder: <code>content/LANGUAGE</code>. Every page to be translated must exist in <b>both</b> folders, in <b>identical</b> places, with an <b>identical</b> file name. 
</p>

<p>
The translation is configured in <code>config.toml</code>, where each language has its own settings (under <code>languages</code>.) This includes the translation of the site’s title and the <code>quicklinks</code>. 
</p>

<p>
Also in the <code>config.toml</code> is the option to <b>disable</b> certain languages. Any language-codes specified here (“en”, “es” etc) will not be available on the site, even if their translation files are there. This is like “draft mode” for site-translation. When you’re working on a translation, disable it! then when the translation is finished, remove the setting.
</p>
</div>
</div>
</div>
<div id="outline-container-org9e1bf24" class="outline-2">
<h2 id="org9e1bf24"><span class="section-number-2">4</span> Images</h2>
<div class="outline-text-2" id="text-4">
<p>
Images should <b>always</b> be less than or equal to 1mb in size. This is critical for google search rankings and user experience, as well as the sustainability of the site as currently configured. (We can support many hundreds of 1mb images.)
</p>

<p>
I recommend starting with the free tool <a href="https://imageoptim.com/howto.html">imageoptim</a> in dealing with this problem. I’m available to help if this proves too difficult to handle. 
</p>
</div>
</div>
