docs/manual.org
* Underlying technologies
All websites are basically made up of three component parts: [[https://developer.mozilla.org/en-US/docs/Web/Guide/HTML/HTML5][HTML]] markup, which describes the things to be found on a page;  [[https://developer.mozilla.org/en-US/docs/Web/CSS][style sheets]] which tell browsers how to show those things; and [[https:https://developer.mozilla.org/en-US/docs/Web/JavaScript][javascript]], which can tell the site to do fancy things. 
** markdown
See this [[https://commonmark.org/help/][cheatsheet]] and this  [[https://commonmark.org/help/tutorial/][10-minute markdown tutorial]].
*** links in markdown
~[Link](http://a.com)~






