docs/manual.html
<div id="outline-container-org8a09b4b" class="outline-2">
<h2 id="org8a09b4b"><span class="section-number-2">5</span> Underlying technologies</h2>
<div class="outline-text-2" id="text-5">
<p>
All websites are basically made up of three component parts: <a href="https://developer.mozilla.org/en-US/docs/Web/Guide/HTML/HTML5">HTML</a> markup, which describes the things to be found on a page;  <a href="https://developer.mozilla.org/en-US/docs/Web/CSS">style sheets</a> which tell browsers how to show those things; and <a href="https:https://developer.mozilla.org/en-US/docs/Web/JavaScript">javascript</a>, which can tell the site to do fancy things. 
</p>
</div>
<div id="outline-container-orgec8ab01" class="outline-3">
<h3 id="orgec8ab01"><span class="section-number-3">5.1</span> markdown</h3>
<div class="outline-text-3" id="text-5-1">
<p>
See this <a href="https://commonmark.org/help/">cheatsheet</a> and this  <a href="https://commonmark.org/help/tutorial/">10-minute markdown tutorial</a>.
</p>
</div>
<div id="outline-container-org85b39f6" class="outline-4">
<h4 id="org85b39f6"><span class="section-number-4">5.1.1</span> links in markdown</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
<code>[Link](http://a.com)</code>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: mikkel</p>
<p class="date">Created: 2021-04-01 Thu 10:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
